It seems like `import` has let me down.

``` 
# aws_fsx_lustre_file_system.lustre[0] must be replaced
-/+ resource "aws_fsx_lustre_file_system" "lustre" {
      ~ arn                           = "redacted" -> (known after apply)
      ~ dns_name                      = "redacted.amazonaws.com" -> (known after apply)
        export_path                   = "s3://redacted"
      ~ id                            = "fs-redacted" -> (known after apply)
        import_path                   = "s3://redacted"
      ~ imported_file_chunk_size      = 2048 -> (known after apply)
      ~ network_interface_ids         = [
          - "eni-redacted",
          - "eni-redacted",
        ] -> (known after apply)
      ~ owner_id                      = "redacted" -> (known after apply)
      + security_group_ids            = [
          + "SAME SG ID AS THE ONE ALREADY ON THE FSx",
        ] # forces replacement
```